Revit 2027 API
VertexStreamPositionNormal.AddVertex Method
 Inserts a VertexStreamPositionNormal into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertex(
	VertexPositionNormal vertex
)
Public Sub AddVertex (
	vertex As VertexPositionNormal
)
public:
void AddVertex(
	VertexPositionNormal^ vertex
)
member AddVertex :
        vertex : VertexPositionNormal -> unit
Parameters
vertex VertexPositionNormal
 The vertex to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace